cfg/Reports/ЧисленностьРаботающихИЗабронированныхГражданЗапаса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ЧисленностьРаботающихИЗабронированныхГражданЗапаса</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрОтбора</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cfg/Reports/ЧисленностьРаботающихИЗабронированныхГражданЗапаса/Forms/ФормаГлавная/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "Перед открытием" формы отчета.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	// Установим дату начала отчета
	Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
		ДатаАктуальности = РабочаяДата;//глТекущийПользователь.ОсновнаяДатаНачалаОтчетов;
		//Организация = глТекущийПользователь.ОсновнаяОрганизация;
		РаботаСДиалогами.ЗаполнитьРеквизитыФормы(ЭтаФорма, глЗначениеПеременной("глТекущийПользователь"))
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = РабочаяДата
	КонецЕсли;
	
	ФормаОтчета = ВосстановитьЗначение("ФормаОтчета");
	Если НЕ ЗначениеЗаполнено(ФормаОтчета) ИЛИ ФормаОтчета = 0 Тогда
		ФормаОтчета = 2015;
	КонецЕсли;

КонецПроцедуры // ПередОткрытием()

// Процедура - обработчик события "При открытии" формы отчета.
//
Процедура ПриОткрытии()
	
	Если НЕ ВладелецФормы = Неопределено Тогда
		
		ЕстьОшибки 	= 	Ложь;
		Если ФормаОтчета = 2015 Тогда
			СформироватьОтчет2015(ЭлементыФормы.ДокументРезультат, ЕстьОшибки);
		Иначе
			СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЕстьОшибки);
		КонецЕсли;	
		Если ЕстьОшибки Тогда
			Сообщить("Ошибки...");
		КонецЕсли;
	Иначе
        ВидОтчета	=	"Форма6";
	КонецЕсли;

КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ

// Процедура - обработчик нажатия кнопки "Сформировать"
//
Процедура КнопкаСформироватьНажатие(Элемент)

	ЕстьОшибки = Ложь;
	ПараметрОтбора 	= 	Организация;
	Если ФормаОтчета = 2015 Тогда 
		СформироватьОтчет2015(ЭлементыФормы.ДокументРезультат, ЕстьОшибки)
	Иначе
		СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЕстьОшибки)
	КонецЕсли;	
	Если ЕстьОшибки Тогда
		Сообщить("Ошибки...")
	КонецЕсли;
	
КонецПроцедуры // КнопкаСформироватьНажатие()

Процедура ПриЗакрытии()
	
	СохранитьЗначение("ФормаОтчета",ФормаОтчета)
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
